# Many to Many Relationships

Think about a Human Resources database for a large company

* Departments
* Employees
* Titles
* Managers
* Salaries

The start of a data model

![](manymany.png)

## Evolving a Many to Many

![](intersectionentity.png)

## From Model to Table

```
employees=# \d departments
          Table "public.departments"
  Column   |         Type          | Modifiers
-----------+-----------------------+-----------
 dept_no   | character(4)          | not null
 dept_name | character varying(40) | not null


employees=# \d dept_emp
       Table "public.dept_emp"
  Column   |     Type     | Modifiers
-----------+--------------+-----------
 emp_no    | integer      | not null
 dept_no   | character(4) | not null
 from_date | date         | not null
 to_date   | date         | not null


employees=# \d employees
            Table "public.employees"
   Column   |         Type          | Modifiers
------------+-----------------------+-----------
 emp_no     | integer               | not null
 birth_date | date                  | not null
 first_name | character varying(14) | not null
 last_name  | character varying(16) | not null
 gender     | character varying(1)  | not null
 hire_date  | date                  | not null

```

In [62]:
import warnings
warnings.filterwarnings('ignore')

In [63]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [2]:
%sql postgresql://millbr02:@localhost/employees

'Connected: millbr02@employees'

In [4]:
%%sql

select * from departments natural join dept_emp where dept_name = 'Marketing' limit 10;

10 rows affected.

[('d001', 'Marketing', 10017, datetime.date(1993, 8, 3), datetime.date(9999, 1, 1)),
 ('d001', 'Marketing', 10055, datetime.date(1992, 4, 27), datetime.date(1995, 7, 22)),
 ('d001', 'Marketing', 10058, datetime.date(1988, 4, 25), datetime.date(9999, 1, 1)),
 ('d001', 'Marketing', 10108, datetime.date(1999, 12, 6), datetime.date(2001, 10, 20)),
 ('d001', 'Marketing', 10140, datetime.date(1991, 3, 14), datetime.date(9999, 1, 1)),
 ('d001', 'Marketing', 10175, datetime.date(1988, 9, 24), datetime.date(1995, 5, 24)),
 ('d001', 'Marketing', 10208, datetime.date(1995, 2, 5), datetime.date(1999, 5, 15)),
 ('d001', 'Marketing', 10228, datetime.date(1993, 1, 28), datetime.date(9999, 1, 1)),
 ('d001', 'Marketing', 10239, datetime.date(1996, 5, 4), datetime.date(9999, 1, 1)),
 ('d001', 'Marketing', 10259, datetime.date(1987, 7, 25), datetime.date(1994, 8, 15))]

OK, that is mildly interesting, but we can ask something more interesting, such as how many employees currently work for the marketing department?

In [6]:
%%sql

select count(*) from departments natural join dept_emp where dept_name = 'Marketing' and now() < to_date;

1 rows affected.

[(14842,)]

**Note:** the ``now()`` function is just a convenience for manually entereing the current date.

In [10]:
%%sql

select dept_name, count(*) from departments natural join dept_emp group by dept_name order by count;

9 rows affected.

[('Finance', 17346),
 ('Human Resources', 17786),
 ('Quality Management', 20117),
 ('Marketing', 20211),
 ('Research', 21126),
 ('Customer Service', 23580),
 ('Sales', 52245),
 ('Production', 73485),
 ('Development', 85707)]

In [15]:
%%sql 

select * from departments natural join dept_emp natural join employees limit 10;

10 rows affected.

[(10001, 'd005', 'Development', datetime.date(1986, 6, 26), datetime.date(9999, 1, 1), datetime.date(1953, 9, 2), 'Georgi', 'Facello', 'M', datetime.date(1986, 6, 26)),
 (10002, 'd007', 'Sales', datetime.date(1996, 8, 3), datetime.date(9999, 1, 1), datetime.date(1964, 6, 2), 'Bezalel', 'Simmel', 'F', datetime.date(1985, 11, 21)),
 (10003, 'd004', 'Production', datetime.date(1995, 12, 3), datetime.date(9999, 1, 1), datetime.date(1959, 12, 3), 'Parto', 'Bamford', 'M', datetime.date(1986, 8, 28)),
 (10004, 'd004', 'Production', datetime.date(1986, 12, 1), datetime.date(9999, 1, 1), datetime.date(1954, 5, 1), 'Chirstian', 'Koblick', 'M', datetime.date(1986, 12, 1)),
 (10005, 'd003', 'Human Resources', datetime.date(1989, 9, 12), datetime.date(9999, 1, 1), datetime.date(1955, 1, 21), 'Kyoichi', 'Maliniak', 'M', datetime.date(1989, 9, 12)),
 (10006, 'd005', 'Development', datetime.date(1990, 8, 5), datetime.date(9999, 1, 1), datetime.date(1953, 4, 20), 'Anneke', 'Preusig', 'F', datetime.date(1989, 6, 2)),
 (10007, 'd008', 'Research', datetime.date(1989, 2, 10), datetime.date(9999, 1, 1), datetime.date(1957, 5, 23), 'Tzvetan', 'Zielinski', 'F', datetime.date(1989, 2, 10)),
 (10008, 'd005', 'Development', datetime.date(1998, 3, 11), datetime.date(2000, 7, 31), datetime.date(1958, 2, 19), 'Saniya', 'Kalloufi', 'M', datetime.date(1994, 9, 15)),
 (10009, 'd006', 'Quality Management', datetime.date(1985, 2, 18), datetime.date(9999, 1, 1), datetime.date(1952, 4, 19), 'Sumant', 'Peac', 'F', datetime.date(1985, 2, 18)),
 (10010, 'd004', 'Production', datetime.date(1996, 11, 24), datetime.date(2000, 6, 26), datetime.date(1963, 6, 1), 'Duangkaew', 'Piveteau', 'F', datetime.date(1989, 8, 24))]

In [22]:
%%sql

select dept_name, last_name 
from departments natural join dept_emp natural join employees 
where first_name = 'Timothy';

0 rows affected.

[]

In [24]:
%%sql

select dept_name, first_name, last_name
from departments natural join dept_manager natural join employees 
where now() < to_date;

9 rows affected.

[('Marketing', 'Vishwani', 'Minakawa'),
 ('Finance', 'Isamu', 'Legleitner'),
 ('Human Resources', 'Karsten', 'Sigstam'),
 ('Production', 'Oscar', 'Ghazalie'),
 ('Development', 'Leon', 'DasSarma'),
 ('Quality Management', 'Dung', 'Pesch'),
 ('Sales', 'Hauke', 'Zhang'),
 ('Research', 'Hilary', 'Kambil'),
 ('Customer Service', 'Yuchang', 'Weedman')]

## The Final LDS

![](employeedb.png)

In [64]:
%sql select distinct title from titles

7 rows affected.

[('Technique Leader',),
 ('Senior Engineer',),
 ('Staff',),
 ('Assistant Engineer',),
 ('Engineer',),
 ('Senior Staff',),
 ('Manager',)]

In [58]:
%%sql

select * from departments natural join dept_emp natural join employees natural join salaries limit 10;

10 rows affected.

[(286829, datetime.date(1994, 3, 14), datetime.date(1995, 1, 11), 'd001', 'Marketing', datetime.date(1954, 11, 10), 'Kazuhisa', 'Vecchio', 'F', datetime.date(1986, 3, 17), 48149),
 (476388, datetime.date(1995, 9, 21), datetime.date(1995, 11, 28), 'd001', 'Marketing', datetime.date(1960, 7, 1), 'Elvis', 'Kroll', 'M', datetime.date(1991, 10, 13), 65007),
 (210440, datetime.date(1996, 9, 18), datetime.date(1996, 11, 10), 'd001', 'Marketing', datetime.date(1964, 7, 11), 'Chandrasekaran', 'Vernadat', 'M', datetime.date(1994, 6, 10), 49760),
 (465625, datetime.date(1996, 10, 4), datetime.date(1997, 7, 7), 'd001', 'Marketing', datetime.date(1961, 10, 2), 'Claudi', 'Piveteau', 'M', datetime.date(1996, 10, 4), 49259),
 (19196, datetime.date(2000, 1, 28), datetime.date(2000, 5, 12), 'd001', 'Marketing', datetime.date(1956, 8, 10), 'Leucio', 'Sury', 'M', datetime.date(1988, 9, 3), 66890),
 (259294, datetime.date(1991, 2, 7), datetime.date(1991, 5, 17), 'd001', 'Marketing', datetime.date(1962, 3, 13), 'Demos', 'Peyn', 'F', datetime.date(1988, 1, 26), 66971),
 (80329, datetime.date(1999, 8, 6), datetime.date(1999, 9, 5), 'd001', 'Marketing', datetime.date(1959, 9, 9), 'Moon', 'Ponthieu', 'F', datetime.date(1988, 11, 7), 40000),
 (268194, datetime.date(1994, 5, 27), datetime.date(1994, 6, 29), 'd001', 'Marketing', datetime.date(1960, 2, 12), 'Gila', 'Aamodt', 'F', datetime.date(1994, 4, 6), 70796),
 (294469, datetime.date(1995, 8, 17), datetime.date(1996, 5, 22), 'd001', 'Marketing', datetime.date(1960, 7, 18), 'Tetsushi', 'Biran', 'M', datetime.date(1987, 6, 21), 68907),
 (12505, datetime.date(1999, 8, 24), datetime.date(2000, 8, 23), 'd001', 'Marketing', datetime.date(1952, 8, 24), 'Barton', 'Goldhammer', 'M', datetime.date(1991, 4, 20), 40423)]

## Question --

The above query seems OK, but there is a problem.  Can you spot what it is?

We know that our friend Barton Goldhammer worked here for more than a year, lets use the above query but limit it to him.  We want to snoop on our friend's salary history...

In [61]:
%%sql

select * from departments natural join dept_emp natural join employees natural join salaries
where employees.emp_no = 12505
 limit 10;

1 rows affected.

[(12505, datetime.date(1999, 8, 24), datetime.date(2000, 8, 23), 'd001', 'Marketing', datetime.date(1952, 8, 24), 'Barton', 'Goldhammer', 'M', datetime.date(1991, 4, 20), 40423)]

Thats even more odd.  Only one row, we know he worked in both marketing and sales and was here until at least 2002.

Think about the `natural join` again...

## JOIN ON

In [65]:
%%sql

select * from departments natural join dept_emp natural join employees join salaries on employees.emp_no = salaries.emp_no 
where employees.emp_no = 12505

6 rows affected.

[(12505, 'd001', 'Marketing', datetime.date(1999, 8, 24), datetime.date(2000, 8, 23), datetime.date(1952, 8, 24), 'Barton', 'Goldhammer', 'M', datetime.date(1991, 4, 20), 12505, 40423, datetime.date(1999, 8, 24), datetime.date(2000, 8, 23)),
 (12505, 'd001', 'Marketing', datetime.date(1999, 8, 24), datetime.date(2000, 8, 23), datetime.date(1952, 8, 24), 'Barton', 'Goldhammer', 'M', datetime.date(1991, 4, 20), 12505, 43758, datetime.date(2000, 8, 23), datetime.date(2001, 8, 23)),
 (12505, 'd001', 'Marketing', datetime.date(1999, 8, 24), datetime.date(2000, 8, 23), datetime.date(1952, 8, 24), 'Barton', 'Goldhammer', 'M', datetime.date(1991, 4, 20), 12505, 43942, datetime.date(2001, 8, 23), datetime.date(2002, 2, 18)),
 (12505, 'd007', 'Sales', datetime.date(2000, 8, 23), datetime.date(2002, 2, 18), datetime.date(1952, 8, 24), 'Barton', 'Goldhammer', 'M', datetime.date(1991, 4, 20), 12505, 40423, datetime.date(1999, 8, 24), datetime.date(2000, 8, 23)),
 (12505, 'd007', 'Sales', datetime.date(2000, 8, 23), datetime.date(2002, 2, 18), datetime.date(1952, 8, 24), 'Barton', 'Goldhammer', 'M', datetime.date(1991, 4, 20), 12505, 43758, datetime.date(2000, 8, 23), datetime.date(2001, 8, 23)),
 (12505, 'd007', 'Sales', datetime.date(2000, 8, 23), datetime.date(2002, 2, 18), datetime.date(1952, 8, 24), 'Barton', 'Goldhammer', 'M', datetime.date(1991, 4, 20), 12505, 43942, datetime.date(2001, 8, 23), datetime.date(2002, 2, 18))]

What is the average salary of the marketing department?

In [29]:
%%sql

select dept_name, min(salary), avg(salary), max(salary)
from  departments natural join dept_emp natural join employees natural join salaries
group by dept_name

9 rows affected.

[('Customer Service', 40000, Decimal('43684.347826086957'), 91638),
 ('Development', 40000, Decimal('49085.105339105339'), 100285),
 ('Finance', 40000, Decimal('61479.844705882353'), 105985),
 ('Human Resources', 40000, Decimal('43069.742788461538'), 73900),
 ('Marketing', 40000, Decimal('59373.385714285714'), 100242),
 ('Production', 40000, Decimal('49057.929073856975'), 98370),
 ('Quality Management', 40000, Decimal('46026.197183098592'), 79334),
 ('Research', 40000, Decimal('49130.981818181818'), 81790),
 ('Sales', 40000, Decimal('69663.258899676375'), 112513)]

In [41]:
%%sql

80 rows affected.

[('Przemyslawa', 'Kaelbling', datetime.date(1985, 1, 1)),
 ('Adil', 'Furedi', datetime.date(1985, 2, 1)),
 ('Shir', 'Munck', datetime.date(1985, 2, 1)),
 ('Yongdong', 'Pileggi', datetime.date(1985, 2, 1)),
 ('Guenter', 'Tanemo', datetime.date(1985, 2, 2)),
 ('Erzsebet', 'Schwartzbauer', datetime.date(1985, 2, 2)),
 ('Kousuke', 'Swist', datetime.date(1985, 2, 2)),
 ('Chaosheng', 'Sommen', datetime.date(1985, 2, 2)),
 ('Holgard', 'Pena', datetime.date(1985, 2, 2)),
 ('Limsoon', 'Macedo', datetime.date(1985, 2, 2)),
 ('Jingling', 'Vesna', datetime.date(1985, 2, 2)),
 ('Toney', 'Skrikant', datetime.date(1985, 2, 2)),
 ('Phillip', 'Teitelbaum', datetime.date(1985, 2, 2)),
 ('Gay', 'Kumaresan', datetime.date(1985, 2, 2)),
 ('Xinglin', 'Marakhovsky', datetime.date(1985, 2, 2)),
 ('Keung', 'Peak', datetime.date(1985, 2, 2)),
 ('Chikako', 'Malabarba', datetime.date(1985, 2, 2)),
 ('Nagui', 'DiGiano', datetime.date(1985, 2, 2)),
 ('Zita', 'Vural', datetime.date(1985, 2, 3)),
 ('Nectarios', 'Perna', datetime.date(1985, 2, 3)),
 ('Premsyl', 'Nitto', datetime.date(1985, 2, 3)),
 ('Chiranjit', 'Stemann', datetime.date(1985, 2, 3)),
 ('Fumitaka', 'Boyle', datetime.date(1985, 2, 3)),
 ('Arup', 'Krohm', datetime.date(1985, 2, 3)),
 ('Fumiyo', 'Cronau', datetime.date(1985, 2, 3)),
 ('Aleksander', 'Masaki', datetime.date(1985, 2, 3)),
 ('Godehard', 'Conte', datetime.date(1985, 2, 3)),
 ('Halsur', 'Birrer', datetime.date(1985, 2, 3)),
 ('Huan', 'Dahlbom', datetime.date(1985, 2, 3)),
 ('Shakhar', 'Sgarro', datetime.date(1985, 2, 3)),
 ('Surveyors', 'Badache', datetime.date(1985, 2, 3)),
 ('Mitchel', 'Gustavson', datetime.date(1985, 2, 3)),
 ('Moti', 'Oppitz', datetime.date(1985, 2, 4)),
 ('Arto', 'Argence', datetime.date(1985, 2, 4)),
 ('Lech', 'Linnainmaa', datetime.date(1985, 2, 4)),
 ('Stafford', 'Luce', datetime.date(1985, 2, 4)),
 ('Fox', 'Waschkowski', datetime.date(1985, 2, 4)),
 ('Khalid', 'Salinas', datetime.date(1985, 2, 4)),
 ('Goa', 'Parfitt', datetime.date(1985, 2, 4)),
 ('Eberhardt', 'Pramanik', datetime.date(1985, 2, 4)),
 ('Xiong', 'Chenoweth', datetime.date(1985, 2, 4)),
 ('Tran', 'Jiang', datetime.date(1985, 2, 4)),
 ('Limsoon', 'Bage', datetime.date(1985, 2, 5)),
 ('Boutros', 'Velardi', datetime.date(1985, 2, 5)),
 ('Ohad', 'Srimani', datetime.date(1985, 2, 5)),
 ('Niteen', 'Matteis', datetime.date(1985, 2, 5)),
 ('Vasilis', 'Pettis', datetime.date(1985, 2, 5)),
 ('Berry', 'Dulli', datetime.date(1985, 2, 5)),
 ('Heather', 'Paciorek', datetime.date(1985, 2, 5)),
 ('Jaques', 'Hashii', datetime.date(1985, 2, 5)),
 ('Rance', 'Chepyzhov', datetime.date(1985, 2, 5)),
 ('Goh', 'Linnainmaa', datetime.date(1985, 2, 5)),
 ('Elvia', 'Baalen', datetime.date(1985, 2, 5)),
 ('Goa', 'Swick', datetime.date(1985, 2, 5)),
 ('Ulf', 'Demos', datetime.date(1985, 2, 5)),
 ('Ramalingam', 'Validov', datetime.date(1985, 2, 5)),
 ('Gregory', 'Griswold', datetime.date(1985, 2, 5)),
 ('Mariusz', 'Pokrovskii', datetime.date(1985, 2, 5)),
 ('Shaleah', 'Panwar', datetime.date(1985, 2, 5)),
 ('Amalendu', 'Hiyoshi', datetime.date(1985, 2, 5)),
 ('Chiranjit', 'Ghelli', datetime.date(1985, 2, 5)),
 ('Miyeon', 'Yemenis', datetime.date(1985, 2, 5)),
 ('Bedrich', 'Lubachevsky', datetime.date(1985, 2, 5)),
 ('Ipke', 'Zallocco', datetime.date(1985, 2, 6)),
 ('Elvia', 'Christ', datetime.date(1985, 2, 6)),
 ('Noritoshi', 'Luff', datetime.date(1985, 2, 6)),
 ('Kagan', 'Radhakrishnan', datetime.date(1985, 2, 6)),
 ('Xiaoqiang', 'Ferriere', datetime.date(1985, 2, 6)),
 ('Uriel', 'Daescu', datetime.date(1985, 2, 6)),
 ('Dhritiman', 'Masamoto', datetime.date(1985, 2, 6)),
 ('Sumant', 'Ertl', datetime.date(1985, 2, 6)),
 ('Hugo', 'Griswold', datetime.date(1985, 2, 6)),
 ('Pragnesh', 'Orlowska', datetime.date(1985, 2, 6)),
 ('Ranan', 'Demir', datetime.date(1985, 2, 6)),
 ('Mohua', 'Pocchiola', datetime.date(1985, 2, 6)),
 ('Xianlong', 'Trachtenberg', datetime.date(1985, 2, 6)),
 ('Nakhoon', 'Falby', datetime.date(1985, 2, 6)),
 ('Horward', 'Steenbeek', datetime.date(1985, 2, 6)),
 ('Adil', 'Uludag', datetime.date(1985, 2, 6)),
 ('Aimee', 'Baja', datetime.date(1985, 2, 6))]

In [44]:
%sql select last_name, count(*) from employees group by last_name order by count(*)  limit 10;

10 rows affected.

[('Sadowsky', 145),
 ('Merro', 147),
 ('Zykh', 148),
 ('Georgatos', 148),
 ('Guardalben', 148),
 ('Rosar', 150),
 ('Zambonelli', 151),
 ('Gonthier', 151),
 ('Nollmann', 151),
 ('Dulli', 151)]